In [1]:
import pandas as pd

In [2]:
dict1 = {'Name': ['Pawan','Aman','Krish','Vishal','Payal','Anushka'],
         'Marks':[98,85,96,88,99,93],
         'Gender':['Male','Male','Male','Male','Female','Female']
        }
df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0    Pawan     98    Male
1     Aman     85    Male
2    Krish     96    Male
3   Vishal     88    Male
4    Payal     99  Female
5  Anushka     93  Female

# 1. Display Top 3 Rows of The Dataset

In [4]:
df1.head(3)

    Name  Marks Gender
0  Pawan     98   Male
1   Aman     85   Male
2  Krish     96   Male

# 2. Check Last 3 Rows of The Dataset

In [5]:
df1.tail(3)

      Name  Marks  Gender
3   Vishal     88    Male
4    Payal     99  Female
5  Anushka     93  Female

# 3. Find Shape of Our Dataset (Number of Rows & Number of Columns)

In [6]:
df1.shape

(6, 3)

In [7]:
print('Number of Rows',df1.shape[0])
print('Number of Columns',df1.shape[1])

Number of Rows 6
Number of Columns 3

# 4. Get Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

# 5. Check Null Values In The Dataset

In [11]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

# 6. Get Overall Statistics About The Dataframe

In [13]:
df1.describe(include='all')

         Name      Marks Gender
count       6   6.000000      6
unique      6        NaN      2
top     Pawan        NaN   Male
freq        1        NaN      4
mean      NaN  93.166667    NaN
std       NaN   5.636193    NaN
min       NaN  85.000000    NaN
25%       NaN  89.250000    NaN
50%       NaN  94.500000    NaN
75%       NaN  97.500000    NaN
max       NaN  99.000000    NaN

# 7. Find Unique Values From The Gender Column

In [14]:
df1

      Name  Marks  Gender
0    Pawan     98    Male
1     Aman     85    Male
2    Krish     96    Male
3   Vishal     88    Male
4    Payal     99  Female
5  Anushka     93  Female

In [15]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8. Find the Number of Unique values from the Gender column

In [16]:
df1['Gender'].nunique()

2

# 9. Display Count of Unique Values In Gender Column

In [18]:
df1['Gender'].value_counts()

Male      4
Female    2
Name: Gender, dtype: int64

# 10. Find Total Number of Students Having Marks Between 90 To 100 (Inclusive) Using Between Method

In [19]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0    Pawan     98    Male
2    Krish     96    Male
4    Payal     99  Female
5  Anushka     93  Female

In [23]:
len(df1[(df1['Marks']>=90)  &  (df1['Marks']<=100)])

4

In [24]:
sum(df1['Marks'].between(90,100))

4

# 11. Find Average Marks

In [25]:
df1

      Name  Marks  Gender
0    Pawan     98    Male
1     Aman     85    Male
2    Krish     96    Male
3   Vishal     88    Male
4    Payal     99  Female
5  Anushka     93  Female

In [26]:
df1['Marks'].mean()

93.16666666666667

# 12. Apply Method

In [27]:
def marks(x):
    return x/2

In [28]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [29]:
df1

      Name  Marks  Gender  Half_marks
0    Pawan     98    Male        49.0
1     Aman     85    Male        42.5
2    Krish     96    Male        48.0
3   Vishal     88    Male        44.0
4    Payal     99  Female        49.5
5  Anushka     93  Female        46.5

In [30]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    42.5
2    48.0
3    44.0
4    49.5
5    46.5
Name: Marks, dtype: float64

In [31]:
df1['Name'].apply(len)

0    5
1    4
2    5
3    6
4    5
5    7
Name: Name, dtype: int64

# 13. Map Function

In [32]:
df1

      Name  Marks  Gender  Half_marks
0    Pawan     98    Male        49.0
1     Aman     85    Male        42.5
2    Krish     96    Male        48.0
3   Vishal     88    Male        44.0
4    Payal     99  Female        49.5
5  Anushka     93  Female        46.5

In [34]:
df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})

In [35]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0    Pawan     98    Male        49.0            1
1     Aman     85    Male        42.5            1
2    Krish     96    Male        48.0            1
3   Vishal     88    Male        44.0            1
4    Payal     99  Female        49.5            0
5  Anushka     93  Female        46.5            0

# 14. Drop the Column(s)

In [37]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0    Pawan     98    Male        49.0            1
1     Aman     85    Male        42.5            1
2    Krish     96    Male        48.0            1
3   Vishal     88    Male        44.0            1
4    Payal     99  Female        49.5            0
5  Anushka     93  Female        46.5            0

In [39]:
df1.drop(['Male_Female','Half_marks'],axis=1,inplace=True)

In [40]:
df1

      Name  Marks  Gender
0    Pawan     98    Male
1     Aman     85    Male
2    Krish     96    Male
3   Vishal     88    Male
4    Payal     99  Female
5  Anushka     93  Female

# 15. Print Name of the Columns

In [41]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [42]:
df1.index

RangeIndex(start=0, stop=6, step=1)

# 16. Sort The Dataframe As Per The Marks Column

In [43]:
df1

      Name  Marks  Gender
0    Pawan     98    Male
1     Aman     85    Male
2    Krish     96    Male
3   Vishal     88    Male
4    Payal     99  Female
5  Anushka     93  Female

In [46]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender
4    Payal     99  Female
0    Pawan     98    Male
2    Krish     96    Male
5  Anushka     93  Female
3   Vishal     88    Male
1     Aman     85    Male

# 17. Display Name & Marks of The Female Students

In [47]:
df1

      Name  Marks  Gender
0    Pawan     98    Male
1     Aman     85    Male
2    Krish     96    Male
3   Vishal     88    Male
4    Payal     99  Female
5  Anushka     93  Female

In [48]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
4    Payal     99
5  Anushka     93

In [49]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
4    Payal     99
5  Anushka     93